rottenpotatoes/app/controllers/movies_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY title

  def edit
    flash[:notice] = pp params
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    flash[:notice] = pp params
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'PG-13', "updated_at" = '2016-03-31 22:02:19.504572' WHERE "movies"."id" = 1

  def same_director
    #@movie = Movie.find(1)
    @movie = Movie.find(params[:movie_id])
	if (@movie.director.nil? || @movie.director.empty?)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL